In [1]:
import pandas as pd 
import numpy as np
import math
import random
import matplotlib.pyplot as plt
import scipy.stats as stat

In [2]:
data = pd.ExcelFile("KPMG_Data.xlsx")
pd1 = pd.read_excel(data, sheet_name=1)
pd2 = pd.read_excel(data, sheet_name=2)
pd3 = pd.read_excel(data, sheet_name=3)
pd4 = pd.read_excel(data, sheet_name=4)

C:\Users\tiwar\AppData\Local\Temp\ipykernel_11016\1318131103.py:3: FutureWarning: Inferring datetime64[ns] from data containing strings is deprecated and will be removed in a future version. To retain the old behavior explicitly pass Series(data, dtype=datetime64[ns])
  pd2 = pd.read_excel(data, sheet_name=2)
C:\Users\tiwar\AppData\Local\Temp\ipykernel_11016\1318131103.py:4: FutureWarning: Inferring datetime64[ns] from data containing strings is deprecated and will be removed in a future version. To retain the old behavior explicitly pass Series(data, dtype=datetime64[ns])
  pd3 = pd.read_excel(data, sheet_name=3)

In [3]:
Transactions = pd.DataFrame(pd1)
NewCustomerList = pd.DataFrame(pd2)
CustomerDemographic = pd.DataFrame(pd3)
CustomerAddress = pd.DataFrame(pd4)

In [4]:
Transactions.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,41245.0
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361.0
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,36145.0
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,42226.0

In [5]:
Transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             19640 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

In [6]:
Transactions.duplicated().sum()

0

In [7]:
Transactions.shape

(20000, 13)

In [8]:
Transactions.nunique()

transaction_id             20000
product_id                   101
customer_id                 3494
transaction_date             364
online_order                   2
order_status                   2
brand                          6
product_line                   4
product_class                  3
product_size                   3
list_price                   296
standard_cost                103
product_first_sold_date      100
dtype: int64

In [9]:
Transactions.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [10]:
Transactions = Transactions.sort_values(['customer_id', 'transaction_date'])

In [11]:
Transactions['online_order'].value_counts()

1.0    9829
0.0    9811
Name: online_order, dtype: int64

In [12]:
Transactions['online_order'] = Transactions['online_order'].fillna(method='bfill')

In [13]:
Transactions['online_order'] = Transactions['online_order'].replace('1.0', 'Yes').replace('0.0', 'No')

In [14]:
Transactions['online_order'].value_counts()

1.0    10017
0.0     9983
Name: online_order, dtype: int64

In [15]:
Transactions['brand'].value_counts()

Solex             4253
Giant Bicycles    3312
WeareA2B          3295
OHM Cycles        3043
Trek Bicycles     2990
Norco Bicycles    2910
Name: brand, dtype: int64

In [16]:
Transactions['brand'] = Transactions['brand'].fillna(method='bfill')

In [17]:
Transactions['product_line'].value_counts()

Standard    14176
Road         3970
Touring      1234
Mountain      423
Name: product_line, dtype: int64

In [18]:
Transactions['product_line'] = Transactions['product_line'].fillna(method='bfill')

In [19]:
Transactions['product_class'].value_counts()

medium    13826
high       3013
low        2964
Name: product_class, dtype: int64

In [20]:
Transactions['product_class'] = Transactions['product_class'].fillna(method='bfill')

In [21]:
Transactions['product_size'].value_counts()

medium    12990
large      3976
small      2837
Name: product_size, dtype: int64

In [22]:
Transactions['product_size'] = Transactions['product_size'].fillna(method='bfill')

In [23]:
Transactions.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20000 entries, 9784 to 8707
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             20000 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    20000 non-null  object
 7   product_line             20000 non-null  object
 8   product_class            20000 non-null  object
 9   product_size             20000 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.1+ MB

In [24]:
pd.options.display.float_format = '{:,.2f}'.format
CustomerStdCost = Transactions.groupby(['customer_id']).mean().round(decimals=2)
CustomerStdCost

,transaction_id,product_id,online_order,list_price,standard_cost,product_first_sold_date
customer_id,,,,,,
1,"11,485.64",34.18,0.55,825.86,551.49,"37,314.09"
2,"8,471.67",37.33,0.33,"1,383.02",640.94,"38,775.67"
3,"13,842.62",60.38,0.12,"1,236.03",815.68,"39,350.25"
4,"13,544.50",78.50,0.50,523.86,413.58,"36,008.50"
5,"7,969.67",48.17,0.33,983.87,584.71,"37,361.00"
...,...,...,...,...,...,...
3497,"8,565.00",32.33,0.67,"1,248.02",698.58,"38,680.33"
3498,"9,327.50",72.17,0.83,862.84,338.29,"37,723.67"
3499,"6,871.29",42.71,0.57,"1,096.21",388.32,"38,163.86"
3500,"10,076.00",40.00,0.33,820.40,522.76,"36,432.50"
5034,"14,292.67",0.00,0.00,506.64,416.81,"37,254.67"

In [25]:
Transactions['standard_cost'] = Transactions['standard_cost'].fillna(CustomerStdCost.standard_cost)

In [26]:
Transactions['product_first_sold_date'] = Transactions['product_first_sold_date'].fillna(Transactions['product_first_sold_date'])

In [27]:
Transactions['product_first_sold_date']

9784    37,873.00
13423   38,573.00
14485   33,455.00
18969   35,378.00
3764    39,526.00
           ...
2462    41,245.00
8561    33,888.00
17468   33,879.00
16700   35,667.00
8707    42,218.00
Name: product_first_sold_date, Length: 20000, dtype: float64

In [28]:
Transactions['product_first_sold_date'] = pd.to_datetime(Transactions['product_first_sold_date'])
Transactions['product_first_sold_date'].head()

9784    1970-01-01 00:00:00.000037873
13423   1970-01-01 00:00:00.000038573
14485   1970-01-01 00:00:00.000033455
18969   1970-01-01 00:00:00.000035378
3764    1970-01-01 00:00:00.000039526
Name: product_first_sold_date, dtype: datetime64[ns]

In [29]:
Transactions['product_first_sold_date'] = Transactions['product_first_sold_date'].dt.date

In [30]:
Transactions.duplicated().sum()

0

In [31]:
Transactions.nunique()

transaction_id             20000
product_id                   101
customer_id                 3494
transaction_date             364
online_order                   2
order_status                   2
brand                          6
product_line                   4
product_class                  3
product_size                   3
list_price                   296
standard_cost                124
product_first_sold_date        1
dtype: int64

In [32]:
Transactions.head(20)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
9784,9785,72,1,2017-01-05,0.00,Approved,Norco Bicycles,Standard,medium,medium,360.40,270.30,1970-01-01
13423,13424,2,1,2017-02-21,0.00,Approved,Solex,Standard,medium,medium,71.49,53.62,1970-01-01
14485,14486,23,1,2017-03-27,0.00,Approved,Norco Bicycles,Mountain,low,small,688.63,612.88,1970-01-01
18969,18970,11,1,2017-03-29,1.00,Approved,Giant Bicycles,Standard,high,medium,"1,274.93",764.96,1970-01-01
3764,3765,38,1,2017-04-06,1.00,Approved,Solex,Standard,medium,medium,"1,577.53",826.51,1970-01-01
5156,5157,47,1,2017-05-11,1.00,Approved,Trek Bicycles,Road,low,small,"1,720.70","1,531.42",1970-01-01
13643,13644,25,1,2017-05-19,0.00,Approved,Giant Bicycles,Road,medium,medium,"1,538.99",829.65,1970-01-01
15662,15663,32,1,2017-06-04,1.00,Approved,Giant Bicycles,Standard,medium,medium,642.70,211.37,1970-01-01
16422,16423,9,1,2017-12-09,1.00,Approved,OHM Cycles,Road,medium,medium,742.54,667.40,1970-01-01
14930,14931,31,1,2017-12-14,1.00,Approved,Giant Bicycles,Standard,medium,medium,230.91,173.18,1970-01-01
93,94,86,1,2017-12-23,0.00,Approved,OHM Cycles,Standard,medium,medium,235.63,125.07,1970-01-01
2260,2261,1,2,2017-05-04,1.00,Approved,Giant Bicycles,Standard,medium,medium,"1,403.50",954.82,1970-01-01
6742,6743,85,2,2017-06-11,0.00,Approved,WeareA2B,Standard,medium,medium,752.64,205.36,1970-01-01
16410,16411,26,2,2017-08-24,0.00,Approved,WeareA2B,Standard,medium,medium,"1,992.93",762.63,1970-01-01
10301,10302,33,3,2017-02-23,0.00,Approved,Giant Bicycles,Standard,medium,small,"1,311.44","1,167.18",1970-01-01
15187,15188,82,3,2017-03-24,0.00,Approved,Norco Bicycles,Standard,high,medium,"1,148.64",689.18,1970-01-01
12953,12954,77,3,2017-04-05,0.00,Approved,Norco Bicycles,Road,medium,large,"1,240.31",795.10,1970-01-01
11783,11784,55,3,2017-04-21,1.00,Approved,Trek Bicycles,Road,medium,large,"1,894.19",598.76,1970-01-01
16724,16725,90,3,2017-06-26,0.00,Approved,Norco Bicycles,Standard,low,medium,363.01,290.41,1970-01-01
13284,13285,47,3,2017-09-04,0.00,Approved,Trek Bicycles,Road,low,small,"1,720.70","1,531.42",1970-01-01

In [33]:
Transactions

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
9784,9785,72,1,2017-01-05,0.00,Approved,Norco Bicycles,Standard,medium,medium,360.40,270.30,1970-01-01
13423,13424,2,1,2017-02-21,0.00,Approved,Solex,Standard,medium,medium,71.49,53.62,1970-01-01
14485,14486,23,1,2017-03-27,0.00,Approved,Norco Bicycles,Mountain,low,small,688.63,612.88,1970-01-01
18969,18970,11,1,2017-03-29,1.00,Approved,Giant Bicycles,Standard,high,medium,"1,274.93",764.96,1970-01-01
3764,3765,38,1,2017-04-06,1.00,Approved,Solex,Standard,medium,medium,"1,577.53",826.51,1970-01-01
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2462,2463,2,3500,2017-04-25,0.00,Approved,Solex,Standard,medium,medium,71.49,53.62,1970-01-01
8561,8562,33,3500,2017-08-08,0.00,Approved,Giant Bicycles,Standard,medium,small,"1,311.44","1,167.18",1970-01-01
17468,17469,0,5034,2017-01-03,0.00,Approved,OHM Cycles,Road,medium,medium,742.54,667.40,1970-01-01
16700,16701,0,5034,2017-01-27,0.00,Approved,Norco Bicycles,Standard,medium,medium,360.40,270.30,1970-01-01
8707,8708,0,5034,2017-10-07,0.00,Approved,Solex,Road,medium,medium,416.98,312.74,1970-01-01

In [34]:
Transactions.to_csv('./Transactions.csv', index=False)

In [35]:
NewCustomerList.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 23 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           1000 non-null   object
 1   last_name                            971 non-null    object
 2   gender                               1000 non-null   object
 3   past_3_years_bike_related_purchases  1000 non-null   int64
 4   DOB                                  983 non-null    datetime64[ns]
 5   job_title                            894 non-null    object
 6   job_industry_category                835 non-null    object
 7   wealth_segment                       1000 non-null   object
 8   deceased_indicator                   1000 non-null   object
 9   owns_car                             1000 non-null   object
 10  tenure                               1000 non-null   int64
 11  address                              1000 non-null   object
 12  postcode                             1000 non-null   int64
 13  state                                1000 non-null   object
 14  country                              1000 non-null   object
 15  property_valuation                   1000 non-null   int64
 16  Unnamed: 16                          1000 non-null   float64
 17  Unnamed: 17                          1000 non-null   float64
 18  Unnamed: 18                          1000 non-null   float64
 19  Unnamed: 19                          1000 non-null   float64
 20  Unnamed: 20                          1000 non-null   int64
 21  Rank                                 1000 non-null   int64
 22  Value                                1000 non-null   float64
dtypes: datetime64[ns](1), float64(5), int64(6), object(11)
memory usage: 179.8+ KB

In [36]:
NewCustomerList.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,...,QLD,Australia,6,0.89,1.11,1.39,1.18,1,1,1.72
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,...,NSW,Australia,11,0.95,0.95,1.19,1.01,1,1,1.72
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,...,VIC,Australia,5,0.53,0.53,0.53,0.53,1,1,1.72
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,...,QLD,Australia,1,0.98,1.23,1.23,1.23,4,4,1.70
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,...,NSW,Australia,9,0.64,0.64,0.80,0.80,4,4,1.70

In [37]:
NewCustomerList.tail()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
995,Ferdinand,Romanetti,Male,60,1959-10-07,Paralegal,Financial Services,Affluent Customer,N,No,...,NSW,Australia,7,1.09,1.09,1.09,1.09,996,996,0.37
996,Burk,Wortley,Male,22,2001-10-17,Senior Sales Associate,Health,Mass Customer,N,No,...,NSW,Australia,10,0.52,0.52,0.65,0.55,997,997,0.36
997,Melloney,Temby,Female,17,1954-10-05,Budget/Accounting Analyst IV,Financial Services,Affluent Customer,N,Yes,...,QLD,Australia,2,0.69,0.86,0.86,0.86,997,997,0.36
998,Dickie,Cubbini,Male,30,1952-12-17,Financial Advisor,Financial Services,Mass Customer,N,Yes,...,QLD,Australia,2,0.82,1.02,1.02,0.87,997,997,0.36
999,Sylas,Duffill,Male,56,1955-10-02,Staff Accountant IV,Property,Mass Customer,N,Yes,...,NSW,Australia,9,0.92,1.15,1.44,1.22,1000,1000,0.34

In [38]:
NewCustomerList.duplicated().sum()

0

In [39]:
NewCustomerList.nunique()

first_name                              940
last_name                               961
gender                                    3
past_3_years_bike_related_purchases     100
DOB                                     958
job_title                               184
job_industry_category                     9
wealth_segment                            3
deceased_indicator                        1
owns_car                                  2
tenure                                   23
address                                1000
postcode                                522
state                                     3
country                                   1
property_valuation                       12
Unnamed: 16                              71
Unnamed: 17                             132
Unnamed: 18                             190
Unnamed: 19                             329
Unnamed: 20                             324
Rank                                    324
Value                                   324
dtype: int64

In [40]:
NewCustomerList.isnull().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Unnamed: 16                              0
Unnamed: 17                              0
Unnamed: 18                              0
Unnamed: 19                              0
Unnamed: 20                              0
Rank                                     0
Value                                    0
dtype: int64

In [41]:
del NewCustomerList['Unnamed: 16']
del NewCustomerList['Unnamed: 17']
del NewCustomerList['Unnamed: 18']
del NewCustomerList['Unnamed: 19']
del NewCustomerList['Unnamed: 20']

In [42]:
NewCustomerList.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 18 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           1000 non-null   object
 1   last_name                            971 non-null    object
 2   gender                               1000 non-null   object
 3   past_3_years_bike_related_purchases  1000 non-null   int64
 4   DOB                                  983 non-null    datetime64[ns]
 5   job_title                            894 non-null    object
 6   job_industry_category                835 non-null    object
 7   wealth_segment                       1000 non-null   object
 8   deceased_indicator                   1000 non-null   object
 9   owns_car                             1000 non-null   object
 10  tenure                               1000 non-null   int64
 11  address                              1000 non-null   object
 12  postcode                             1000 non-null   int64
 13  state                                1000 non-null   object
 14  country                              1000 non-null   object
 15  property_valuation                   1000 non-null   int64
 16  Rank                                 1000 non-null   int64
 17  Value                                1000 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(5), object(11)
memory usage: 140.8+ KB

In [43]:
NewCustomerList['last_name'] = NewCustomerList.groupby('first_name').last_name.bfill().ffill()

In [44]:
NewCustomerList['gender'].value_counts()

Female    513
Male      470
U          17
Name: gender, dtype: int64

In [45]:
NewCustomerList[NewCustomerList.gender == "U"]

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Rank,Value
59,Normy,Goodinge,U,5,NaT,Associate Professor,IT,Mass Customer,N,No,4,7232 Fulton Parkway,3810,VIC,Australia,5,57,1.38
226,Hatti,Carletti,U,35,NaT,Legal Assistant,IT,Affluent Customer,N,Yes,11,6 Iowa Center,2519,NSW,Australia,9,226,1.11
324,Rozamond,Turtle,U,69,NaT,Legal Assistant,IT,Mass Customer,N,Yes,3,57025 New Castle Street,3850,VIC,Australia,3,324,1.01
358,Tamas,Swatman,U,65,NaT,Assistant Media Planner,Entertainment,Affluent Customer,N,No,5,78 Clarendon Drive,4551,QLD,Australia,8,358,0.98
360,Tracy,Andrejevic,U,71,NaT,Programmer II,IT,Mass Customer,N,Yes,11,5675 Burning Wood Trail,3030,VIC,Australia,7,361,0.98
374,Agneta,McAmish,U,66,NaT,Structural Analysis Engineer,IT,Mass Customer,N,No,15,5773 Acker Way,4207,QLD,Australia,6,375,0.96
434,Gregg,Aimeric,U,52,NaT,Internal Auditor,IT,Mass Customer,N,No,7,72423 Surrey Street,3753,VIC,Australia,5,433,0.91
439,Johna,Bunker,U,93,NaT,Tax Accountant,IT,Mass Customer,N,Yes,14,3686 Waubesa Way,3065,VIC,Australia,6,436,0.90
574,Harlene,Nono,U,69,NaT,Human Resources Manager,IT,Mass Customer,N,No,12,0307 Namekagon Crossing,2170,NSW,Australia,7,575,0.80
598,Gerianne,Kaysor,U,15,NaT,Project Manager,IT,Affluent Customer,N,No,5,882 Toban Lane,2121,NSW,Australia,11,599,0.78
664,Chicky,Sinclar,U,43,NaT,Operator,IT,High Net Worth,N,Yes,0,5 Red Cloud Place,3222,VIC,Australia,4,662,0.71
751,Adriana,Saundercock,U,20,NaT,Nurse,IT,High Net Worth,N,Yes,14,82 Gina Junction,3806,VIC,Australia,7,751,0.65
775,Dmitri,Viant,U,62,NaT,Paralegal,Financial Services,Affluent Customer,N,No,5,95960 Warner Parkway,3842,VIC,Australia,1,774,0.63
835,Porty,Hansed,U,88,NaT,General Manager,IT,Mass Customer,N,No,13,768 Southridge Drive,2112,NSW,Australia,11,832,0.58
883,Shara,Bramhill,U,24,NaT,NaN,IT,Affluent Customer,N,No,2,01 Bunker Hill Drive,2230,NSW,Australia,10,883,0.53
904,Roth,Crum,U,0,NaT,Legal Assistant,IT,Mass Customer,N,No,2,276 Anthes Court,2450,NSW,Australia,6,904,0.50
984,Pauline,Dallosso,U,82,NaT,Desktop Support Technician,IT,Affluent Customer,N,Yes,0,9594 Badeau Street,2050,NSW,Australia,10,985,0.41

In [46]:
NewCustomerList['gender'] = NewCustomerList['gender'].replace('U', 'Unspecified')

In [47]:
NewCustomerList['gender'].value_counts()

Female         513
Male           470
Unspecified     17
Name: gender, dtype: int64

In [48]:
NewCustomerList['state'].value_counts()

NSW    506
VIC    266
QLD    228
Name: state, dtype: int64

In [49]:
NewCustomerList['country'].value_counts()

Australia    1000
Name: country, dtype: int64

In [50]:
NewCustomerList['address'].value_counts()

45 Shopko Center             1
77608 Donald Center          1
7 Elgar Hill                 1
36506 Bartillon Point        1
8 Scott Drive                1
                            ..
102 Charing Cross Terrace    1
5 Trailsway Avenue           1
23694 Leroy Place            1
53 Memorial Street           1
21875 Grover Drive           1
Name: address, Length: 1000, dtype: int64

In [51]:
NewCustomerList['address'].nunique()

1000

In [52]:
NewCustomerList['DOB'] = NewCustomerList['DOB'].dt.date

In [53]:
NewCustomerList['DOB'].value_counts()

1998-02-05    2
1978-01-15    2
1977-11-08    2
1951-11-28    2
1979-07-28    2
             ..
1945-08-08    1
1943-08-27    1
1999-10-24    1
1976-01-24    1
1955-10-02    1
Name: DOB, Length: 958, dtype: int64

In [54]:
#NewCustomerList['DOB'].fillna(lambda x: np.random.choice(NewCustomerList['DOB']), inplace=True)

In [55]:
NewCustomerList['DOB'].head()

0    1957-07-12
1    1970-03-22
2    1974-08-28
3    1979-01-28
4    1965-09-21
Name: DOB, dtype: object

In [56]:
NewCustomerList['job_title'].value_counts()

Associate Professor         15
Environmental Tech          14
Software Consultant         14
Chief Design Engineer       13
Assistant Manager           12
                            ..
Accountant II                1
Programmer IV                1
Administrative Officer       1
Accounting Assistant III     1
Web Developer I              1
Name: job_title, Length: 184, dtype: int64

In [57]:
NewCustomerList['job_title'] = NewCustomerList['job_title'].fillna(method='ffill')

In [58]:
NewCustomerList['job_industry_category'].value_counts()

Financial Services    203
Manufacturing         199
Health                152
Retail                 78
Property               64
IT                     51
Entertainment          37
Argiculture            26
Telecommunications     25
Name: job_industry_category, dtype: int64

In [59]:
NewCustomerList['job_industry_category'] = NewCustomerList['job_industry_category'].fillna(method='ffill')

In [60]:
NewCustomerList.columns = map(str.lower, NewCustomerList.columns)
NewCustomerList.columns = map(str.strip, NewCustomerList.columns)

In [61]:
NewCustomerList.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,dob,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,rank,value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,14,45 Shopko Center,4500,QLD,Australia,6,1,1.72
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,16,14 Mccormick Park,2113,NSW,Australia,11,1,1.72
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,10,5 Colorado Crossing,3505,VIC,Australia,5,1,1.72
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,5,207 Annamark Plaza,4814,QLD,Australia,1,4,1.70
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,19,115 Montana Place,2093,NSW,Australia,9,4,1.70

In [62]:
NewCustomerList['value'] = NewCustomerList['value'].round(3)
NewCustomerList

,first_name,last_name,gender,past_3_years_bike_related_purchases,dob,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,rank,value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,14,45 Shopko Center,4500,QLD,Australia,6,1,1.72
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,16,14 Mccormick Park,2113,NSW,Australia,11,1,1.72
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,10,5 Colorado Crossing,3505,VIC,Australia,5,1,1.72
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,5,207 Annamark Plaza,4814,QLD,Australia,1,4,1.70
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,19,115 Montana Place,2093,NSW,Australia,9,4,1.70
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,Ferdinand,Romanetti,Male,60,1959-10-07,Paralegal,Financial Services,Affluent Customer,N,No,9,2 Sloan Way,2200,NSW,Australia,7,996,0.37
996,Burk,Wortley,Male,22,2001-10-17,Senior Sales Associate,Health,Mass Customer,N,No,6,04 Union Crossing,2196,NSW,Australia,10,997,0.36
997,Melloney,Temby,Female,17,1954-10-05,Budget/Accounting Analyst IV,Financial Services,Affluent Customer,N,Yes,15,33475 Fair Oaks Junction,4702,QLD,Australia,2,997,0.36
998,Dickie,Cubbini,Male,30,1952-12-17,Financial Advisor,Financial Services,Mass Customer,N,Yes,19,57666 Victoria Way,4215,QLD,Australia,2,997,0.36
999,Sylas,Duffill,Male,56,1955-10-02,Staff Accountant IV,Property,Mass Customer,N,Yes,14,21875 Grover Drive,2010,NSW,Australia,9,1000,0.34

In [63]:
NewCustomerList.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 18 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           1000 non-null   object
 1   last_name                            1000 non-null   object
 2   gender                               1000 non-null   object
 3   past_3_years_bike_related_purchases  1000 non-null   int64
 4   dob                                  983 non-null    object
 5   job_title                            1000 non-null   object
 6   job_industry_category                1000 non-null   object
 7   wealth_segment                       1000 non-null   object
 8   deceased_indicator                   1000 non-null   object
 9   owns_car                             1000 non-null   object
 10  tenure                               1000 non-null   int64
 11  address                              1000 non-null   object
 12  postcode                             1000 non-null   int64
 13  state                                1000 non-null   object
 14  country                              1000 non-null   object
 15  property_valuation                   1000 non-null   int64
 16  rank                                 1000 non-null   int64
 17  value                                1000 non-null   float64
dtypes: float64(1), int64(5), object(12)
memory usage: 140.8+ KB

In [64]:
NewCustomerList.to_csv('./NewCustomerList.csv', index=False)

In [65]:
CustomerDemographic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 13 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4000 non-null   int64
 1   first_name                           4000 non-null   object
 2   last_name                            3875 non-null   object
 3   gender                               4000 non-null   object
 4   past_3_years_bike_related_purchases  4000 non-null   int64
 5   DOB                                  3913 non-null   datetime64[ns]
 6   job_title                            3494 non-null   object
 7   job_industry_category                3344 non-null   object
 8   wealth_segment                       4000 non-null   object
 9   deceased_indicator                   4000 non-null   object
 10  default                              3698 non-null   object
 11  owns_car                             4000 non-null   object
 12  tenure                               3913 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(9)
memory usage: 406.4+ KB

In [66]:
CustomerDemographic.shape

(4000, 13)

In [67]:
CustomerDemographic.nunique()

customer_id                            4000
first_name                             3139
last_name                              3725
gender                                    6
past_3_years_bike_related_purchases     100
DOB                                    3448
job_title                               195
job_industry_category                     9
wealth_segment                            3
deceased_indicator                        2
default                                  90
owns_car                                  2
tenure                                   22
dtype: int64

In [68]:
CustomerDemographic.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
default                                302
owns_car                                 0
tenure                                  87
dtype: int64

In [69]:
CustomerDemographic.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.00
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.00
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15.00
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,No,7.00
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.00

In [70]:
CustomerDemographic.tail()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
3995,3996,Rosalia,Halgarth,Female,8,1975-08-09,VP Product Management,Health,Mass Customer,N,-100,No,19.00
3996,3997,Blanch,Nisuis,Female,87,2001-07-13,Statistician II,Manufacturing,High Net Worth,N,â¦testâ§,Yes,1.00
3997,3998,Sarene,Woolley,U,60,NaT,Assistant Manager,IT,High Net Worth,N,NaN,No,NaN
3998,3999,Patrizius,NaN,Male,11,1973-10-24,NaN,Manufacturing,Affluent Customer,N,Â¡â¢Â£Â¢âÂ§Â¶â¢ÂªÂºââ,Yes,10.00
3999,4000,Kippy,Oldland,Male,76,1991-11-05,Software Engineer IV,NaN,Affluent Customer,N,0/0,No,11.00

In [71]:
CustomerDemographic.duplicated().sum()

0

In [72]:
CustomerDemographic['last_name'] = CustomerDemographic.groupby('first_name').last_name.bfill().ffill()

In [73]:
CustomerDemographic['gender'].value_counts()

Female    2037
Male      1872
U           88
F            1
Femal        1
M            1
Name: gender, dtype: int64

In [74]:
CustomerDemographic['gender'] = CustomerDemographic['gender'].replace('F', 'Female').replace('M', 'Male').replace('U', 'Unspecified').replace('Femal', 'Female')

In [75]:
CustomerDemographic['gender'].value_counts()

Female         2039
Male           1873
Unspecified      88
Name: gender, dtype: int64

In [76]:
CustomerDemographic['DOB'] = CustomerDemographic['DOB'].dt.date

In [77]:
CustomerDemographic['DOB'].value_counts()

1978-01-30    7
1964-07-08    4
1962-12-17    4
1978-08-19    4
1977-05-13    4
             ..
1989-06-16    1
1998-09-30    1
1985-03-11    1
1989-10-23    1
1991-11-05    1
Name: DOB, Length: 3448, dtype: int64

In [78]:
#CustomerDemographic['DOB'].fillna(lambda x: np.random.choice(CustomerDemographic['DOB']), inplace=True)

In [79]:
CustomerDemographic['DOB'].value_counts()

1978-01-30    7
1964-07-08    4
1962-12-17    4
1978-08-19    4
1977-05-13    4
             ..
1989-06-16    1
1998-09-30    1
1985-03-11    1
1989-10-23    1
1991-11-05    1
Name: DOB, Length: 3448, dtype: int64

In [80]:
CustomerDemographic['job_title'].value_counts()

Business Systems Development Analyst    45
Tax Accountant                          44
Social Worker                           44
Internal Auditor                        42
Recruiting Manager                      41
                                        ..
Database Administrator I                 4
Health Coach I                           3
Health Coach III                         3
Research Assistant III                   3
Developer I                              1
Name: job_title, Length: 195, dtype: int64

In [81]:
CustomerDemographic['job_title'] =CustomerDemographic['job_title'].fillna(method='ffill')

In [82]:
CustomerDemographic['job_industry_category'].value_counts()

Manufacturing         799
Financial Services    774
Health                602
Retail                358
Property              267
IT                    223
Entertainment         136
Argiculture           113
Telecommunications     72
Name: job_industry_category, dtype: int64

In [83]:
CustomerDemographic['job_industry_category'] =CustomerDemographic['job_industry_category'].fillna(method='ffill')

In [84]:
CustomerDemographic['deceased_indicator'].value_counts()

N    3998
Y       2
Name: deceased_indicator, dtype: int64

In [85]:
f = {'N': False, 'Y': True}
CustomerDemographic['deceased_indicator'] = CustomerDemographic['deceased_indicator'].map(f).fillna(CustomerDemographic['deceased_indicator'])

In [86]:
CustomerDemographic['deceased_indicator'].value_counts()

False    3998
True        2
Name: deceased_indicator, dtype: int64

In [87]:
CustomerDemographic['wealth_segment'].value_counts()

Mass Customer        2000
High Net Worth       1021
Affluent Customer     979
Name: wealth_segment, dtype: int64

In [88]:
CustomerDemographic['default'].value_counts()

100                                       113
1                                         112
-1                                        111
-100                                       99
Ù¡Ù¢Ù£                                     53
                                         ...
testâ testâ«                               31
/dev/null; touch /tmp/blns.fail ; echo     30
âªâªtestâª                                 29
ì¸ëë°í ë¥´                                 27
,ãã»:*:ã»ãâ( â» Ï â» )ãã»:*:ã»ãâ           25
Name: default, Length: 90, dtype: int64

In [89]:
del CustomerDemographic['default']

In [90]:
CustomerDemographic['owns_car'].value_counts()

Yes    2024
No     1976
Name: owns_car, dtype: int64

In [91]:
g = {'No': False, 'Yes': True}
CustomerDemographic['owns_car'] = CustomerDemographic['owns_car'].map(g).fillna(CustomerDemographic['owns_car'])

In [92]:
CustomerDemographic['owns_car'].value_counts()

True     2024
False    1976
Name: owns_car, dtype: int64

In [93]:
CustomerDemographic['tenure'].value_counts()

7.00     235
5.00     228
11.00    221
10.00    218
16.00    215
8.00     211
18.00    208
12.00    202
9.00     200
14.00    200
6.00     192
13.00    191
4.00     191
17.00    182
15.00    179
1.00     166
3.00     160
19.00    159
2.00     150
20.00     96
22.00     55
21.00     54
Name: tenure, dtype: int64

In [94]:
np.nanmedian(CustomerDemographic['tenure'])

11.0

In [95]:
CustomerDemographic['tenure'].fillna(value = 11.0, inplace = True)

In [96]:
CustomerDemographic.isnull().sum()

customer_id                             0
first_name                              0
last_name                               0
gender                                  0
past_3_years_bike_related_purchases     0
DOB                                    87
job_title                               0
job_industry_category                   0
wealth_segment                          0
deceased_indicator                      0
owns_car                                0
tenure                                  0
dtype: int64

In [97]:
CustomerDemographic.columns = map(str.lower, CustomerDemographic.columns)
CustomerDemographic.columns = map(str.strip, CustomerDemographic.columns)

In [98]:
CustomerDemographic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 12 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4000 non-null   int64
 1   first_name                           4000 non-null   object
 2   last_name                            4000 non-null   object
 3   gender                               4000 non-null   object
 4   past_3_years_bike_related_purchases  4000 non-null   int64
 5   dob                                  3913 non-null   object
 6   job_title                            4000 non-null   object
 7   job_industry_category                4000 non-null   object
 8   wealth_segment                       4000 non-null   object
 9   deceased_indicator                   4000 non-null   bool
 10  owns_car                             4000 non-null   bool
 11  tenure                               4000 non-null   float64
dtypes: bool(2), float64(1), int64(2), object(7)
memory usage: 320.4+ KB

In [99]:
CustomerDemographic.to_csv('./CustomerDemographic.csv',index=False)

In [100]:
CustomerAddress.shape

(3999, 6)

In [101]:
CustomerAddress.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   int64
 1   address             3999 non-null   object
 2   postcode            3999 non-null   int64
 3   state               3999 non-null   object
 4   country             3999 non-null   object
 5   property_valuation  3999 non-null   int64
dtypes: int64(3), object(3)
memory usage: 187.6+ KB

In [102]:
CustomerAddress.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [103]:
CustomerAddress.duplicated().sum()

0

In [104]:
CustomerAddress.isnull().sum()

customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

In [105]:
CustomerAddress.nunique()

customer_id           3999
address               3996
postcode               873
state                    5
country                  1
property_valuation      12
dtype: int64

In [106]:
CustomerAddress['customer_id'].is_unique

True

In [107]:
CustomerAddress['address'].is_unique

False

In [108]:
CustomerAddress.duplicated(subset=['address', 'postcode'], keep='first').value_counts()

False    3999
dtype: int64

In [109]:
CustomerAddress['address'].is_unique

False

In [110]:
CustomerAddress['postcode'].value_counts()

2170    31
2155    30
2145    30
2153    29
3977    26
        ..
3808     1
3114     1
4721     1
4799     1
3089     1
Name: postcode, Length: 873, dtype: int64

In [111]:
CustomerAddress['state'].value_counts()

NSW                2054
VIC                 939
QLD                 838
New South Wales      86
Victoria             82
Name: state, dtype: int64

In [112]:
CustomerAddress['state'] = CustomerAddress['state'].replace('New South Wales', 'NSW').replace('Victoria', 'VIC')

In [113]:
CustomerAddress['state'].value_counts()

NSW    2140
VIC    1021
QLD     838
Name: state, dtype: int64

In [114]:
CustomerAddress['country'].value_counts()

Australia    3999
Name: country, dtype: int64

In [115]:
CustomerAddress['property_valuation'].value_counts()

9     647
8     646
10    577
7     493
11    281
6     238
5     225
4     214
12    195
3     186
1     154
2     143
Name: property_valuation, dtype: int64

In [116]:
CustomerAddress.columns = map(str.lower, CustomerAddress.columns)
CustomerAddress.columns = map(str.strip, CustomerAddress.columns)

In [117]:
CustomerAddress

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,NSW,Australia,10
1,2,6 Meadow Vale Court,2153,NSW,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,NSW,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9
...,...,...,...,...,...,...
3994,3999,1482 Hauk Trail,3064,VIC,Australia,3
3995,4000,57042 Village Green Point,4511,QLD,Australia,6
3996,4001,87 Crescent Oaks Alley,2756,NSW,Australia,10
3997,4002,8194 Lien Street,4032,QLD,Australia,7
3998,4003,320 Acker Drive,2251,NSW,Australia,7

In [118]:
CustomerAddress.to_csv('./CustomerAddress.csv', index=False)